import React from 'react';
import { Paper, Typography, Box, Container, Grid } from '@mui/material';
import pic from 'assets/images/pic.webp';

const About = () => {
  return (
    <Box py={10} id='about'>
      <Container>
        <Typography variant='h3' mb={4} align='center'>
          Про мене
        </Typography>
        <Grid container alignItems='center'>
          <Grid item md={6}>
            <Paper sx={{ p: 3, background: '#f0f0f0', mb: 4 }}>
              <Typography>
                Мене звуть Світлана Павлюк і я займаюсь індивідуальною
                адвокатською діяльністю. У 2010 році закінчила Національну
                юридичну академію імені Ярослава Мудрого за спеціальністю
                "Правознавство" та здобула кваліфікацію юриста. У 2019 році
                закінчила регіональний інститут державного управління
                Національної академії державного управління при Президентові
                України та здобула кваліфікацію магістра публічного управління
                та адміністрування. З 2010 року працювала в системі примусового
                виконання судових рішень і рішень інших органів (посадових
                осіб), пройшовши шлях від державного виконавця до заступника
                начальника відділу. У своєму житті я орієнтована на розвиток та
                зацікавлена в реальних результатах. Мої цінності співзвучні з
                Конституцією України, згідно якої : "Людина, її життя і
                здоров'я, честь і гідність, недоторканність і безпека визнаються
                в Україні найвищою соціальною цінністю". І я хочу щоб ця
                цінність не лише визнавалась, але й була реальна в сучасній
                Україні. Саме тому я - адвокат і можу вам допомогти.
              </Typography>
            </Paper>
          </Grid>
          <Grid item md={6}>
            <Box
              component='img'
              maxWidth={400}
              sx={{ display: 'block', m: 'auto', width: '100%' }}
              src={pic}
            />
          </Grid>
        </Grid>
      </Container>
    </Box>
  );
};

export default About;
